In [1]:
import pandas as pd

# 시리즈 만들기

In [5]:
data = ['nam', 'A', 80, 50, 70]
adsp1 = pd.Series(data, index=['이름', '고사장', '데이터 이해', '데이터분석기획','데이터분석'])
adsp1

이름         nam
고사장          A
데이터 이해      80
데이터분석기획     50
데이터분석       70
dtype: object

# 데이터프레임 만들기

In [30]:
adsp_data = {'이름':['lee','kim','nam','park'],
             '고사장':['A','A','B','B'],
             '데이터이해':[47, 92, 80, 56],
             '데이터분석기획':[50, 84, 50, 62],
             '데이터분석':[73, 80, 70, 70]}
adsp_res = pd.DataFrame(adsp_data)
adsp_res.set_index("이름", inplace=True)
adsp_res

     고사장  데이터이해  데이터분석기획  데이터분석
이름
lee    A     47       50     73
kim    A     92       84     80
nam    B     80       50     70
park   B     56       62     70

# 데이터프레임에서 시리즈 선택하기

In [11]:
adsp_res['데이터이해']

이름
lee     47
kim     92
nam     80
park    56
Name: 데이터이해, dtype: int64

# index, values 사용하기

In [13]:
adsp_res.index

Index(['lee', 'kim', 'nam', 'park'], dtype='object', name='이름')

In [16]:
adsp_res.values

array([['A', 47, 50, 73],
       ['A', 92, 84, 80],
       ['B', 80, 50, 70],
       ['B', 56, 62, 70]], dtype=object)

In [17]:
adsp_res['데이터이해'].values

array([47, 92, 80, 56], dtype=int64)

# 시리즈의 mean, min, max, std 메서드 사용하기

In [42]:
adsp_res['데이터이해'].mean()

68.75

In [43]:
adsp_res['데이터이해'].min()

47

In [44]:
adsp_res['데이터이해'].max()

92

In [48]:
round(adsp_res['데이터이해'].std(), 2)

20.84

In [31]:
adsp_res['총점'] = adsp_res.sum(axis=1)
adsp_res

     고사장  데이터이해  데이터분석기획  데이터분석   총점
이름
lee    A     47       50     73  170
kim    A     92       84     80  256
nam    B     80       50     70  200
park   B     56       62     70  188

In [40]:
adsp_res['평균'] = adsp_res.iloc[:,1:4].mean(axis=1).round(2)
adsp_res

     고사장  데이터이해  데이터분석기획  데이터분석   총점     평균
이름
lee    A     47       50     73  170  56.67
kim    A     92       84     80  256  85.33
nam    B     80       50     70  200  66.67
park   B     56       62     70  188  62.67

# 시리즈와 불린 추출 사용하기

In [49]:
scientists = pd.read_csv('pandas_data/scientists.csv')
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [53]:
#Age열에 대해 평균보다 큰 age만(데이터) 추출
a_mean = scientists.Age.mean()
a_mean

59.125

In [55]:
scientists[scientists.Age > a_mean]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

# 시리즈와 브로드캐스팅

In [69]:
# age열에 대해 모두 +10 *2 ... 연산
# 시리즈와 스칼라 연산
scientists.Age.dtypes
scientists['Age'] + 10
scientists['Age'] * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

# 열의 자료형 바꾸기와 새로운 열 추가하기

In [80]:
scientists.dtypes
scientists['Age'] = scientists['Age'].astype(str)
scientists.dtypes

Name          object
Born          object
Died          object
Age           object
Occupation    object
dtype: object

In [89]:
scientists['newName'] = scientists['Occupation']+ "-" +scientists['Name']
scientists

,Name,Born,Died,Age,Occupation,newName
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,Chemist-Rosaline Franklin
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,Statistician-William Gosset
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,Nurse-Florence Nightingale
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,Chemist-Marie Curie
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,Biologist-Rachel Carson
5,John Snow,1813-03-15,1858-06-16,45,Physician,Physician-John Snow
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,Computer Scientist-Alan Turing
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,Mathematician-Johann Gauss

# 데이터프레임의 열 삭제하기

In [90]:
del scientists['newName']
scientists

                   Name        Born        Died Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16  37             Chemist
1        William Gosset  1876-06-13  1937-10-16  61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13  90               Nurse
3           Marie Curie  1867-11-07  1934-07-04  66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14  56           Biologist
5             John Snow  1813-03-15  1858-06-16  45           Physician
6           Alan Turing  1912-06-23  1954-06-07  41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23  77       Mathematician